
// creating an array and passing the number, questions, options, and answers
let questions = [
    {
             numb: 1,
             question: "यथासमय समास है ?",
             answer: "अव्ययीभाव",
             options: [
                 "तत्पुरुष",
                 "अव्ययीभाव",
                 "कर्मधारय",
                 "बहुव्रीहि"
             ]
           },
           {
            numb: 2,
            question: "इनमें से कौन सा शब्द संज्ञा से बना हुआ विशेषण है?",
            answer: "कुलीन",
            options: [
              "कृपा",
              "जाति",
              "नमक",
              "कुलीन"
            ]
          },
          {
            numb: 3,
            question: "संज्ञा के कितनें भेद हैं ?",
            answer: "5",
            options: [
                "2",
              "5",
              "4",
              "8"  
            ]
          },
          {
            numb: 4,
            question: "सर्वनाम कितनें प्रकार के होते हैं ?",
            answer: "6",
            options: [
              "2",
              "5",
              "3",
              "6"
            ]
          },
          {
            numb: 5,
            question: "निम्नलिखित में से घर का पर्यायवाची शब्द नहीं है ?",
            answer: "पावक",
            options: [
              "पावक",
              " आलय ",
              "सदन",
              "निकेतन"
            ]
          },
          {
            numb: 6,
            question: "निम्नलिखित में से इच्छा का पर्यायवाची शब्द नहीं है ?",
            answer: "यातना",
            options: [
              "लिप्सा",
              "कामना",
              "यातना",
              "स्पृहा"
            ]
          },
          {
            numb: 7,
            question: "रसभरा' कौन-सा तत्पुरुष समास है ?",
            answer: "करण-तत्पुरुष",
            options: [
              "कर्म-तत्पुरुष",
              "करण-तत्पुरुष",
              "संप्रदान-तत्पुरुष",
              "इनमें से कोई नहीं"
            ]
          },
          {
            numb: 8,
            question: "तुम अपने काम में सफल रहो' कौन-सा वाक्य है ?",
            answer: "इच्छावाचक वाक्य",
            options: [
              "इच्छावाचक वाक्य",
              "सन्देहवाचक वाक्य",
              "विधिवाचक वाक्य",
              "इनमें से कोई नहीं"
            ]
          },

];